app/controllers/comments_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "hello"], ["event_id", 1], ["user_id", 2], ["created_at", "2021-06-28 18:04:00.676587"], ["updated_at", "2021-06-28 18:04:00.676587"]]
---
  def create
    @event = Event.find(params[:event_id])
    @comment = Comment.where(event_id: @event.id).new(comment_params)
    @comment.user = @current_user
    if @comment.save