app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    # associates event with user who created it
    # it's also a more secure way to accept form data
    @event.user = @current_user

    if @event.save
---
INSERT INTO "events" ("date", "event_url", "venue_name", "venue_location", "performer_name", "performer_img_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"